package OOP.Lab1;

/*
Создать класс AngleRange для хранения промежтка для углов
 - Реализовать механизм создания объекта через задание начальной и конечной точки промежукта в виде углов float,
   int или Angle
 - Предусмотреть возможность использования включающих и исключающих промежутков
 - конструктор (start: Point2d, end: Point2d)
 - реализовать возможность сравнения объектов на эквивалентность (eq)
 - реализовать строкове представление объекта (str, repr)
 - реализовать получение длины промежутка (abs или отдельны метод)
 - реализовать сравнение промежутков
 - реализовать операцию in для проверки входит один промежуток в другой или угол в промежуток
 - реализовать операции сложения, вычитания (результат в общем виде - список промежутков)
 */

public class AngleRange
{

}
